tiborsimon/embedded-tdd-headers/pic/8bit/pic18f26k40_tdd.h
#define PSCNT11                       522
#define WDTPSCNT11                    523
#define PSCNT12                       524
#define WDTPSCNT12                    525
#define PSCNT13                       526
#define WDTPSCNT13                    527
#define PSCNT14                       528
#define WDTPSCNT14                    529
#define PSCNT15                       530
#define WDTPSCNT15                    531
#define PSCNT16                       532
#define WDTPSCNT16                    533
#define WDTPSCNT17                    534
#define PSCNT17                       535
#define STATE                         536
#define WDTSTATE                      537
#define WDTTMR                        538
#define WDTTMR0                       539
#define WDTTMR1                       540
#define WDTTMR2                       541
#define WDTTMR3                       542
#define WDTTMR4                       543
#define CPUDOZE                       544
#define DOZE0                         545
#define DOZE                          546
#define DOZE1                         547
#define DOZE2                         548
#define DOE                           549
#define ROI                           550
#define DOZEN                         551
#define IDLEN                         552
#define OSCCON1                       553
#define NDIV0                         554
#define NDIV                          555
#define NDIV1                         556
#define NDIV2                         557
#define NDIV3                         558
#define NOSC0                         559
#define NOSC                          560
#define NOSC1                         561
#define NOSC2                         562
#define OSCCON2                       563
#define CDIV0                         564
#define CDIV                          565
#define CDIV1                         566
#define CDIV2                         567
#define CDIV3                         568
#define COSC                          569
#define COSC0                         570
#define COSC1                         571
#define COSC2                         572
#define OSCCON3                       573
#define NOSCR                         574
#define ORDY                          575
#define SOSCPWR                       576
#define CSWHOLD                       577
#define OSCSTAT                       578
#define PLLR                          579
#define ADOR                          580
#define SOR                           581
#define LFOR                          582
#define MFOR                          583
#define HFOR                          584
#define EXTOR                         585
#define OSCEN                         586
#define ADOEN                         587
#define SOSCEN                        588
#define LFOEN                         589
#define MFOEN                         590
#define HFOEN                         591
#define EXTOEN                        592
#define OSCTUNE                       593
#define TUN0                          594
#define TUN                           595
#define TUN1                          596
#define TUN2                          597
#define TUN3                          598
#define TUN4                          599
#define TUN5                          600
#define OSCFRQ                        601
#define HFFRQ                         602
#define FRQ0                          603
#define FRQ1                          604
#define FRQ2                          605
#define FRQ3                          606
#define VREGCON                       607
#define VREGPM0                       608
#define VREGPM                        609
#define VREGPM1                       610
#define BORCON                        611
#define BORRDY                        612
#define SBOREN                        613
#define PMD0                          614
#define IOCMD                         615
#define CLKRMD                        616
#define SPI1MD                        617
#define SPI2MD                        618
#define NVMMD                         619
#define SCANMD                        620
#define CRCMD                         621
#define HLVDMD                        622
#define FVRMD                         623
#define SYSCMD                        624
#define PMD1                          625
#define EMBMD                         626
#define TMR0MD                        627
#define TMR1MD                        628
#define TMR2MD                        629
#define TMR3MD                        630
#define TMR4MD                        631
#define TMR5MD                        632
#define TMR6MD                        633
#define PMD2                          634
#define ZCDMD                         635
#define CMP1MD                        636
#define CMP2MD                        637
#define ADCMD                         638
#define DACMD                         639
#define PMD3                          640
#define CCP1MD                        641
#define CCP2MD                        642
#define PWM3MD                        643
#define PWM4MD                        644
#define PMD4                          645
#define CWGMD                         646
#define CWG1MD                        647
#define MSSP1MD                       648
#define MSSP2MD                       649
#define UART1MD                       650
#define UART2MD                       651
#define PMD5                          652
#define DSMMD                         653
#define RA0PPS                        654
#define RA0PPS0                       655
#define RA0PPS1                       656
#define RA0PPS2                       657
#define RA0PPS3                       658
#define RA0PPS4                       659
#define RA1PPS                        660
#define RA1PPS0                       661
#define RA1PPS1                       662
#define RA1PPS2                       663
#define RA1PPS3                       664
#define RA1PPS4                       665
#define RA2PPS                        666
#define RA2PPS0                       667
#define RA2PPS1                       668
#define RA2PPS2                       669
#define RA2PPS3                       670
#define RA2PPS4                       671
#define RA3PPS                        672
#define RA3PPS0                       673
#define RA3PPS1                       674
#define RA3PPS2                       675
#define RA3PPS3                       676
#define RA3PPS4                       677
#define RA4PPS                        678
#define RA4PPS0                       679
#define RA4PPS1                       680
#define RA4PPS2                       681
#define RA4PPS3                       682
#define RA4PPS4                       683
#define RA5PPS                        684
#define RA5PPS0                       685
#define RA5PPS1                       686
#define RA5PPS2                       687
#define RA5PPS3                       688
#define RA5PPS4                       689
#define RA6PPS                        690
#define RA6PPS0                       691
#define RA6PPS1                       692
#define RA6PPS2                       693
#define RA6PPS3                       694
#define RA6PPS4                       695
#define RA7PPS                        696
#define RA7PPS0                       697
#define RA7PPS1                       698
#define RA7PPS2                       699
#define RA7PPS3                       700
#define RA7PPS4                       701
#define RB0PPS                        702
#define RB0PPS0                       703
#define RB0PPS1                       704
#define RB0PPS2                       705
#define RB0PPS3                       706
#define RB0PPS4                       707
#define RB1PPS                        708
#define RB1PPS0                       709
#define RB1PPS1                       710
#define RB1PPS2                       711
#define RB1PPS3                       712
#define RB1PPS4                       713
#define RB2PPS                        714
#define RB2PPS0                       715
#define RB2PPS1                       716
#define RB2PPS2                       717
#define RB2PPS3                       718
#define RB2PPS4                       719
#define RB3PPS                        720
#define RB3PPS0                       721
#define RB3PPS1                       722
#define RB3PPS2                       723
#define RB3PPS3                       724
#define RB3PPS4                       725
#define RB4PPS                        726
#define RB4PPS0                       727
#define RB4PPS1                       728
#define RB4PPS2                       729
#define RB4PPS3                       730
#define RB4PPS4                       731
#define RB5PPS                        732
#define RB5PPS0                       733
#define RB5PPS1                       734
#define RB5PPS2                       735
#define RB5PPS3                       736
#define RB5PPS4                       737
#define RB6PPS                        738
#define RB6PPS0                       739
#define RB6PPS1                       740
#define RB6PPS2                       741
#define RB6PPS3                       742
#define RB6PPS4                       743
#define RB7PPS                        744
#define RB7PPS0                       745
#define RB7PPS1                       746
#define RB7PPS2                       747
#define RB7PPS3                       748
#define RB7PPS4                       749
#define RC0PPS                        750
#define RC0PPS0                       751
#define RC0PPS1                       752
#define RC0PPS2                       753
#define RC0PPS3                       754
#define RC0PPS4                       755
#define RC1PPS                        756
#define RC1PPS0                       757
#define RC1PPS1                       758
#define RC1PPS2                       759
#define RC1PPS3                       760
#define RC1PPS4                       761
#define RC2PPS                        762
#define RC2PPS0                       763
#define RC2PPS1                       764
#define RC2PPS2                       765
#define RC2PPS3                       766
#define RC2PPS4                       767
#define RC3PPS                        768
#define RC3PPS0                       769
#define RC3PPS1                       770
#define RC3PPS2                       771
#define RC3PPS3                       772
#define RC3PPS4                       773
#define RC4PPS                        774
#define RC4PPS0                       775
#define RC4PPS1                       776
#define RC4PPS2                       777
#define RC4PPS3                       778
#define RC4PPS4                       779
#define RC5PPS                        780
#define RC5PPS0                       781
#define RC5PPS1                       782
#define RC5PPS2                       783
#define RC5PPS3                       784
#define RC5PPS4                       785
#define RC6PPS                        786
#define RC6PPS0                       787
#define RC6PPS1                       788
#define RC6PPS2                       789
#define RC6PPS3                       790
#define RC6PPS4                       791
#define RC7PPS                        792
#define RC7PPS0                       793
#define RC7PPS1                       794
#define RC7PPS2                       795
#define RC7PPS3                       796
#define RC7PPS4                       797
#define IOCAF                         798
#define IOCAF0                        799
#define IOCAF1                        800
#define IOCAF2                        801
#define IOCAF3                        802
#define IOCAF4                        803
#define IOCAF5                        804
#define IOCAF6                        805
#define IOCAF7                        806
#define IOCAN                         807
#define IOCAN0                        808
#define IOCAN1                        809
#define IOCAN2                        810
#define IOCAN3                        811
#define IOCAN4                        812
#define IOCAN5                        813
#define IOCAN6                        814
#define IOCAN7                        815
#define IOCAP                         816
#define IOCAP0                        817
#define IOCAP1                        818
#define IOCAP2                        819
#define IOCAP3                        820
#define IOCAP4                        821
#define IOCAP5                        822
#define IOCAP6                        823
#define IOCAP7                        824
#define INLVLA                        825
#define INLVLA0                       826
#define INLVLA1                       827
#define INLVLA2                       828
#define INLVLA3                       829
#define INLVLA4                       830
#define INLVLA5                       831
#define INLVLA6                       832
#define INLVLA7                       833
#define SLRCONA                       834
#define SLRA0                         835
#define SLRA1                         836
#define SLRA2                         837
#define SLRA3                         838
#define SLRA4                         839
#define SLRA5                         840
#define SLRA6                         841
#define SLRA7                         842
#define ODCONA                        843
#define ODCA0                         844
#define ODCA1                         845
#define ODCA2                         846
#define ODCA3                         847
#define ODCA4                         848
#define ODCA5                         849
#define ODCA6                         850
#define ODCA7                         851
#define WPUA                          852
#define WPUA0                         853
#define WPUA1                         854
#define WPUA2                         855
#define WPUA3                         856
#define WPUA4                         857
#define WPUA5                         858
#define WPUA6                         859
#define WPUA7                         860
#define ANSELA                        861
#define ANSELA0                       862
#define ANSELA1                       863
#define ANSELA2                       864
#define ANSELA3                       865
#define ANSELA4                       866
#define ANSELA5                       867
#define ANSELA6                       868
#define ANSELA7                       869
#define IOCBF                         870
#define IOCBF0                        871
#define IOCBF1                        872
#define IOCBF2                        873
#define IOCBF3                        874
#define IOCBF4                        875
#define IOCBF5                        876
#define IOCBF6                        877
#define IOCBF7                        878
#define IOCBN                         879
#define IOCBN0                        880
#define IOCBN1                        881
#define IOCBN2                        882
#define IOCBN3                        883
#define IOCBN4                        884
#define IOCBN5                        885
#define IOCBN6                        886
#define IOCBN7                        887
#define IOCBP                         888
#define IOCBP0                        889
#define IOCBP1                        890
#define IOCBP2                        891
#define IOCBP3                        892
#define IOCBP4                        893
#define IOCBP5                        894
#define IOCBP6                        895
#define IOCBP7                        896
#define INLVLB                        897
#define INLVLB0                       898
#define INLVLB1                       899
#define INLVLB2                       900
#define INLVLB3                       901
#define INLVLB4                       902
#define INLVLB5                       903
#define INLVLB6                       904
#define INLVLB7                       905
#define SLRCONB                       906
#define SLRB0                         907
#define SLRB1                         908
#define SLRB2                         909
#define SLRB3                         910
#define SLRB4                         911
#define SLRB5                         912
#define SLRB6                         913
#define SLRB7                         914
#define ODCONB                        915
#define ODCB0                         916
#define ODCB1                         917
#define ODCB2                         918
#define ODCB3                         919
#define ODCB4                         920
#define ODCB5                         921
#define ODCB6                         922
#define ODCB7                         923
#define WPUB                          924
#define WPUB0                         925
#define WPUB1                         926
#define WPUB2                         927
#define WPUB3                         928
#define WPUB4                         929
#define WPUB5                         930
#define WPUB6                         931
#define WPUB7                         932
#define ANSELB                        933
#define ANSELB0                       934
#define ANSELB1                       935
#define ANSELB2                       936
#define ANSELB3                       937
#define ANSELB4                       938
#define ANSELB5                       939
#define ANSELB6                       940
#define ANSELB7                       941
#define IOCCF                         942
#define IOCCF0                        943
#define IOCCF1                        944
#define IOCCF2                        945
#define IOCCF3                        946
#define IOCCF4                        947
#define IOCCF5                        948
#define IOCCF6                        949
#define IOCCF7                        950
#define IOCCN                         951
#define IOCCN0                        952
#define IOCCN1                        953
#define IOCCN2                        954
#define IOCCN3                        955
#define IOCCN4                        956
#define IOCCN5                        957
#define IOCCN6                        958
#define IOCCN7                        959
#define IOCCP                         960
#define IOCCP0                        961
#define IOCCP1                        962
#define IOCCP2                        963
#define IOCCP3                        964
#define IOCCP4                        965
#define IOCCP5                        966
#define IOCCP6                        967
#define IOCCP7                        968
#define INLVLC                        969
#define INLVLC0                       970
#define INLVLC1                       971
#define INLVLC2                       972
#define INLVLC3                       973
#define INLVLC4                       974
#define INLVLC5                       975
#define INLVLC6                       976
#define INLVLC7                       977
#define SLRCONC                       978
#define SLRC0                         979
#define SLRC1                         980
#define SLRC2                         981
#define SLRC3                         982
#define SLRC4                         983
#define SLRC5                         984
#define SLRC6                         985
#define SLRC7                         986
#define ODCONC                        987
#define ODCC0                         988
#define ODCC1                         989
#define ODCC2                         990
#define ODCC3                         991
#define ODCC4                         992
#define ODCC5                         993
#define ODCC6                         994
#define ODCC7                         995
#define WPUC                          996
#define WPUC0                         997
#define WPUC1                         998
#define WPUC2                         999
#define WPUC3                         1000
#define WPUC4                         1001
#define WPUC5                         1002
#define WPUC6                         1003
#define WPUC7                         1004
#define ANSELC                        1005
#define ANSELC0                       1006
#define ANSELC1                       1007
#define ANSELC2                       1008
#define ANSELC3                       1009
#define ANSELC4                       1010
#define ANSELC5                       1011
#define ANSELC6                       1012
#define ANSELC7                       1013
#define IOCEF                         1014
#define IOCEF3                        1015
#define IOCEN                         1016
#define IOCEN3                        1017
#define IOCEP                         1018
#define IOCEP3                        1019
#define INLVLE                        1020
#define INLVLE3                       1021
#define WPUE                          1022
#define WPUE3                         1023
#define HLVDCON0                      1024
#define INTL                          1025
#define HLVDINTL                      1026
#define INTH                          1027
#define HLVDINTH                      1028
#define RDY                           1029
#define HLVDRDY                       1030
#define HLVDCON0_OUT                  1031
#define HLVDOUT                       1032
#define HLVDEN                        1033
#define HLVDCON0_EN                   1034
#define HLVDCON1                      1035
#define HLVDSEL0                      1036
#define SEL                           1037
#define SEL0                          1038
#define HLVDSEL1                      1039
#define SEL1                          1040
#define HLVDSEL2                      1041
#define SEL2                          1042
#define HLVDSEL3                      1043
#define SEL3                          1044
#define FVRCON                        1045
#define ADFVR0                        1046
#define ADFVR                         1047
#define ADFVR1                        1048
#define CDAFVR                        1049
#define CDAFVR0                       1050
#define CDAFVR1                       1051
#define TSRNG                         1052
#define TSEN                          1053
#define FVRRDY                        1054
#define FVREN                         1055
#define ZCDCON                        1056
#define ZCDINTN                       1057
#define ZCDINTP                       1058
#define ZCDPOL                        1059
#define ZCDOUT                        1060
#define ZCDSEN                        1061
#define DAC1CON0                      1062
#define NSS                           1063
#define DAC1NSS                       1064
#define DAC1PSS0                      1065
#define PSS                           1066
#define PSS0                          1067
#define PSS1                          1068
#define DAC1PSS1                      1069
#define OE2                           1070
#define DAC1OE2                       1071
#define OE1                           1072
#define DAC1OE1                       1073
#define DAC1CON0_EN                   1074
#define DAC1EN                        1075
#define DAC1CON1                      1076
#define DAC1R                         1077
#define DAC1R0                        1078
#define DAC1R1                        1079
#define DAC1R2                        1080
#define DAC1R3                        1081
#define DAC1R4                        1082
#define CM2CON0                       1083
#define CM2CON0_SYNC                  1084
#define C2SYNC                        1085
#define C2HYS                         1086
#define CM2CON0_HYS                   1087
#define C2POL                         1088
#define CM2CON0_POL                   1089
#define C2OUT                         1090
