tiborsimon/embedded-tdd-headers/pic/8bit/pic18f26k40_tdd.h
#define CM2CON0_OUT                   1091
#define CM2CON0_EN                    1092
#define C2EN                          1093
#define CM2CON1                       1094
#define C2INTN                        1095
#define CM2CON1_INTN                  1096
#define CM2CON1_INTP                  1097
#define C2INTP                        1098
#define CM2NCH                        1099
#define C2NCH0                        1100
#define CM2NCH_NCH0                   1101
#define CM2NCH_NCH                    1102
#define C2NCH1                        1103
#define CM2NCH_NCH1                   1104
#define C2NCH2                        1105
#define CM2NCH_NCH2                   1106
#define CM2PCH                        1107
#define CM2PCH_PCH                    1108
#define C2PCH0                        1109
#define CM2PCH_PCH0                   1110
#define C2PCH1                        1111
#define CM2PCH_PCH1                   1112
#define C2PCH2                        1113
#define CM2PCH_PCH2                   1114
#define CM1CON0                       1115
#define CM1CON0_SYNC                  1116
#define C1SYNC                        1117
#define CM1CON0_HYS                   1118
#define C1HYS                         1119
#define CM1CON0_POL                   1120
#define C1POL                         1121
#define C1OUT                         1122
#define CM1CON0_OUT                   1123
#define CM1CON0_EN                    1124
#define C1EN                          1125
#define CM1CON1                       1126
#define C1INTN                        1127
#define CM1CON1_INTN                  1128
#define CM1CON1_INTP                  1129
#define C1INTP                        1130
#define CM1NCH                        1131
#define C1NCH0                        1132
#define CM1NCH_NCH0                   1133
#define CM1NCH_NCH                    1134
#define C1NCH1                        1135
#define CM1NCH_NCH1                   1136
#define C1NCH2                        1137
#define CM1NCH_NCH2                   1138
#define CM1PCH                        1139
#define CM1PCH_PCH0                   1140
#define C1PCH0                        1141
#define CM1PCH_PCH                    1142
#define CM1PCH_PCH1                   1143
#define C1PCH1                        1144
#define CM1PCH_PCH2                   1145
#define C1PCH2                        1146
#define CMOUT                         1147
#define MC1OUT                        1148
#define MC2OUT                        1149
#define CLKRCON                       1150
#define CLKRDIV0                      1151
#define DIV                           1152
#define DIV0                          1153
#define CLKRDIV1                      1154
#define DIV1                          1155
#define DIV2                          1156
#define CLKRDIV2                      1157
#define CLKRCON_DC                    1158
#define CLKRCON_DC0                   1159
#define CLKRDC0                       1160
#define CLKRCON_DC1                   1161
#define CLKRDC1                       1162
#define CLKRCON_EN                    1163
#define CLKREN                        1164
#define CLKRCLK                       1165
#define CLKRCLK0                      1166
#define CLK                           1167
#define CLK0                          1168
#define CLKRCLK1                      1169
#define CLK1                          1170
#define CLKRCLK2                      1171
#define CLK2                          1172
#define CWG1CLKCON                    1173
#define CWG1CLKCON_CS                 1174
#define CWG1CS                        1175
#define CWG1ISM                       1176
#define CWG1ISM0                      1177
#define IS                            1178
#define CWG1ISM1                      1179
#define CWG1ISM2                      1180
#define CWG1ISM3                      1181
#define CWG1DBR0                      1182
#define CWG1DBR                       1183
#define DBR                           1184
#define DBR0                          1185
#define CWG1DBR1                      1186
#define DBR1                          1187
#define CWG1DBR2                      1188
#define DBR2                          1189
#define CWG1DBR3                      1190
#define DBR3                          1191
#define CWG1DBR4                      1192
#define DBR4                          1193
#define CWG1DBR5                      1194
#define DBR5                          1195
#define CWG1DBF                       1196
#define CWG1DBF0                      1197
#define DBF                           1198
#define DBF0                          1199
#define CWG1DBF1                      1200
#define DBF1                          1201
#define CWG1DBF2                      1202
#define DBF2                          1203
#define CWG1DBF3                      1204
#define DBF3                          1205
#define CWG1DBF4                      1206
#define DBF4                          1207
#define DBF5                          1208
#define CWG1DBF5                      1209
#define CWG1CON0                      1210
#define CWG1MODE0                     1211
#define CWG1CON0_MODE                 1212
#define CWG1CON0_MODE0                1213
#define CWG1MODE                      1214
#define CWG1MODE1                     1215
#define CWG1CON0_MODE1                1216
#define CWG1MODE2                     1217
#define CWG1CON0_MODE2                1218
#define LD                            1219
#define CWG1LD                        1220
#define CWG1EN                        1221
#define G1EN                          1222
#define CWG1CON0_EN                   1223
#define CWG1CON1                      1224
#define CWG1POLA                      1225
#define POLA                          1226
#define CWG1POLB                      1227
#define POLB                          1228
#define CWG1POLC                      1229
#define POLC                          1230
#define CWG1POLD                      1231
#define POLD                          1232
#define IN                            1233
#define CWG1IN                        1234
#define CWG1AS0                       1235
#define CWG1LSAC                      1236
#define LSAC                          1237
#define LSAC0                         1238
#define CWG1LSAC0                     1239
#define LSAC1                         1240
#define CWG1LSAC1                     1241
#define LSBD0                         1242
#define CWG1LSBD0                     1243
#define LSBD                          1244
#define CWG1LSBD                      1245
#define LSBD1                         1246
#define CWG1LSBD1                     1247
#define CWG1REN                       1248
#define REN                           1249
#define CWG1SHUTDOWN                  1250
#define SHUTDOWN                      1251
#define CWG1AS1                       1252
#define AS0E                          1253
#define AS1E                          1254
#define AS2E                          1255
#define AS3E                          1256
#define AS4E                          1257
#define AS5E                          1258
#define CWG1STR                       1259
#define CWG1STRA                      1260
#define STRA                          1261
#define STRB                          1262
#define CWG1STRB                      1263
#define CWG1STRC                      1264
#define STRC                          1265
#define CWG1STRD                      1266
#define STRD                          1267
#define OVRA                          1268
#define CWG1OVRA                      1269
#define CWG1OVRB                      1270
#define OVRB                          1271
#define OVRC                          1272
#define CWG1OVRC                      1273
#define OVRD                          1274
#define CWG1OVRD                      1275
#define SCANLADRL                     1276
#define SCANLADRL_LADR                1277
#define SCANLADRL_SCANLADR            1278
#define LADR0                         1279
#define SCANLADR0                     1280
#define SCANLADR1                     1281
#define LADR1                         1282
#define LADR2                         1283
#define SCANLADR2                     1284
#define LADR3                         1285
#define SCANLADR3                     1286
#define LADR4                         1287
#define SCANLADR4                     1288
#define LADR5                         1289
#define SCANLADR5                     1290
#define SCANLADR6                     1291
#define LADR6                         1292
#define LADR7                         1293
#define SCANLADR7                     1294
#define SCANLADRH                     1295
#define LADR8                         1296
#define SCANLADRH_SCANLADR            1297
#define SCANLADR8                     1298
#define SCANLADRH_LADR                1299
#define LADR9                         1300
#define SCANLADR9                     1301
#define LADR10                        1302
#define SCANLADR10                    1303
#define SCANLADR11                    1304
#define LADR11                        1305
#define LADR12                        1306
#define SCANLADR12                    1307
#define LADR13                        1308
#define SCANLADR13                    1309
#define LADR14                        1310
#define SCANLADR14                    1311
#define LADR15                        1312
#define SCANLADR15                    1313
#define SCANLADRU                     1314
#define LADR16                        1315
#define SCANLADR16                    1316
#define SCANLADRU_SCANLADR            1317
#define SCANLADRU_LADR                1318
#define SCANLADR17                    1319
#define LADR17                        1320
#define LADR18                        1321
#define SCANLADR18                    1322
#define LADR19                        1323
#define SCANLADR19                    1324
#define SCANLADR20                    1325
#define LADR20                        1326
#define SCANLADR21                    1327
#define LADR21                        1328
#define SCANHADRL                     1329
#define SCANHADR0                     1330
#define HADR0                         1331
#define SCANHADRL_HADR                1332
#define SCANHADRL_SCANHADR            1333
#define SCANHADR1                     1334
#define HADR1                         1335
#define SCANHADR2                     1336
#define HADR2                         1337
#define SCANHADR3                     1338
#define HADR3                         1339
#define SCANHADR4                     1340
#define HADR4                         1341
#define SCANHADR5                     1342
#define HADR5                         1343
#define SCANHADR6                     1344
#define HADR6                         1345
#define SCANHADR7                     1346
#define HADR7                         1347
#define SCANHADRH                     1348
#define HADR8                         1349
#define SCANHADRH_SCANHADR            1350
#define SCANHADR8                     1351
#define SCANHADRH_HADR                1352
#define HADR9                         1353
#define SCANHADR9                     1354
#define HADR10                        1355
#define SCANHADR10                    1356
#define SCANHADR11                    1357
#define HADR11                        1358
#define HADR12                        1359
#define SCANHADR12                    1360
#define HADR13                        1361
#define SCANHADR13                    1362
#define HADR14                        1363
#define SCANHADR14                    1364
#define HADR15                        1365
#define SCANHADR15                    1366
#define SCANHADRU                     1367
#define SCANHADRU_SCANHADR            1368
#define SCANHADRU_HADR                1369
#define HADR16                        1370
#define SCANHADR16                    1371
#define SCANHADR17                    1372
#define HADR17                        1373
#define HADR18                        1374
#define SCANHADR18                    1375
#define HADR19                        1376
#define SCANHADR19                    1377
#define HADR20                        1378
#define SCANHADR20                    1379
#define SCANHADR21                    1380
#define HADR21                        1381
#define SCANCON0                      1382
#define SCANMODE0                     1383
#define SCANCON0_MODE                 1384
#define SCANCON0_MODE0                1385
#define SCANMODE                      1386
#define SCANMODE1                     1387
#define SCANCON0_MODE1                1388
#define INTM                          1389
#define SCANINTM                      1390
#define DABORT                        1391
#define SCANINVALID                   1392
#define INVALID                       1393
#define SCANCON0_BUSY                 1394
#define SCANBUSY                      1395
#define SCANCON0_GO                   1396
#define SCANGO                        1397
#define SCANCON0_EN                   1398
#define SCANEN                        1399
#define SCANTRIG                      1400
#define TSEL0                         1401
#define TSEL                          1402
#define SCANTSEL0                     1403
#define SCANTSEL                      1404
#define TSEL1                         1405
#define SCANTSEL1                     1406
#define TSEL2                         1407
#define SCANTSEL2                     1408
#define TSEL3                         1409
#define SCANTSEL3                     1410
#define MDCON0                        1411
#define MDBIT                         1412
#define BIT                           1413
#define OPOL                          1414
#define MDOPOL                        1415
#define MDOUT                         1416
#define MDCON0_OUT                    1417
#define MDEN                          1418
#define MDCON0_EN                     1419
#define MDCON1                        1420
#define MDCLSYNC                      1421
#define CLSYNC                        1422
#define MDCLPOL                       1423
#define CLPOL                         1424
#define CHSYNC                        1425
#define MDCHSYNC                      1426
#define MDCHPOL                       1427
#define CHPOL                         1428
#define MDSRC                         1429
#define SRCS0                         1430
#define MDSRCS                        1431
#define SRCS                          1432
#define MDSRCS0                       1433
#define SRCS1                         1434
#define MDSRCS1                       1435
#define SRCS2                         1436
#define MDSRCS2                       1437
#define SRCS3                         1438
#define MDSRCS3                       1439
#define MDCARL                        1440
#define CLS0                          1441
#define MDCLS                         1442
#define MDCLS0                        1443
#define CLS                           1444
#define CLS1                          1445
#define MDCLS1                        1446
#define CLS2                          1447
#define MDCLS2                        1448
#define MDCARH                        1449
#define CHS0                          1450
#define CHS                           1451
#define MDCHS                         1452
#define MDCHS0                        1453
#define CHS1                          1454
#define MDCHS1                        1455
#define CHS2                          1456
#define MDCHS2                        1457
#define ADACT0                        1458
#define ADACT                         1459
#define ADACT1                        1460
#define ADACT2                        1461
#define ADACT3                        1462
#define ADACT4                        1463
#define ADCLK                         1464
#define ADCS0                         1465
#define ADCLK_ADCS                    1466
#define ADCS1                         1467
#define ADCS2                         1468
#define ADCS3                         1469
#define ADCS4                         1470
#define ADCS5                         1471
#define ADREF                         1472
#define ADPREF                        1473
#define ADPREF0                       1474
#define ADPREF1                       1475
#define ADNREF                        1476
#define ADCON1                        1477
#define ADDSEN                        1478
#define NVCFG0                        1479
#define NVCFG1                        1480
#define PVCFG0                        1481
#define CHSN3                         1482
#define PVCFG1                        1483
#define VCFG11                        1484
#define ADGPOL                        1485
#define ADIPEN                        1486
#define ADPPOL                        1487
#define ADCON2                        1488
#define ADMD                          1489
#define ADMD0                         1490
#define ADMD1                         1491
#define ADMD2                         1492
#define ADACLR                        1493
#define ADCRS                         1494
#define ADCRS0                        1495
#define ADCRS1                        1496
#define ADCRS2                        1497
#define ADPSIS                        1498
#define ADCON3                        1499
#define ADTMD                         1500
#define ADTMD0                        1501
#define ADTMD1                        1502
#define ADTMD2                        1503
#define ADSOI                         1504
#define ADCALC                        1505
#define ADCALC0                       1506
#define ADCALC1                       1507
#define ADCALC2                       1508
#define ADACQ                         1509
#define ADACQ0                        1510
#define ADACQ1                        1511
#define ADACQ2                        1512
#define ADACQ3                        1513
#define ADACQ4                        1514
#define ADACQ5                        1515
#define ADACQ6                        1516
#define ADACQ7                        1517
#define ADCAP                         1518
#define ADCAP0                        1519
#define ADCAP1                        1520
#define ADCAP2                        1521
#define ADCAP3                        1522
#define ADCAP4                        1523
#define ADPRE0                        1524
#define ADPRE                         1525
#define ADPRE1                        1526
#define ADPRE2                        1527
#define ADPRE3                        1528
#define ADPRE4                        1529
#define ADPRE5                        1530
#define ADPRE6                        1531
#define ADPRE7                        1532
#define ADPCH                         1533
#define ADPCH0                        1534
#define ADPCH1                        1535
#define ADPCH2                        1536
#define ADPCH3                        1537
#define ADPCH4                        1538
#define ADPCH5                        1539
#define ADCON0                        1540
#define ADCON0_GO                     1541
#define DONE                          1542
#define GO_NOT_DONE                   1543
#define GO_nDONE                      1544
#define ADGO                          1545
#define GODONE                        1546
#define ADFM                          1547
#define ADFM0                         1548
#define ADCON0_ADCS                   1549
#define ADCONT                        1550
#define ADCAL                         1551
#define ADON                          1552
#define ADPREVL                       1553
#define ADPREV0                       1554
#define ADPREV1                       1555
#define ADPREV2                       1556
#define ADPREV3                       1557
#define ADPREV4                       1558
#define ADPREV5                       1559
#define ADPREV6                       1560
#define ADPREV7                       1561
#define ADPREVH                       1562
#define ADPREV8                       1563
#define ADPREV9                       1564
#define ADPREV10                      1565
#define ADPREV11                      1566
#define ADPREV12                      1567
#define ADPREV13                      1568
#define ADPREV14                      1569
#define ADPREV15                      1570
#define ADRESL                        1571
#define ADRES0                        1572
#define ADRES1                        1573
#define ADRES2                        1574
#define ADRES3                        1575
#define ADRES4                        1576
#define ADRES5                        1577
#define ADRES6                        1578
#define ADRES7                        1579
#define ADRESH                        1580
#define ADRES8                        1581
#define ADRES9                        1582
#define ADRES10                       1583
#define ADRES11                       1584
#define ADRES12                       1585
#define ADRES13                       1586
#define ADRES14                       1587
#define ADRES15                       1588
#define ADSTAT                        1589
#define ADSTAT0                       1590
#define ADSTAT1                       1591
#define ADSTAT2                       1592
#define ADMATH                        1593
#define ADLTHR                        1594
#define ADUTHR                        1595
#define ADAOV                         1596
#define ADRPT0                        1597
#define ADRPT                         1598
#define ADRPT1                        1599
#define ADRPT2                        1600
#define ADRPT3                        1601
#define ADRPT4                        1602
#define ADRPT5                        1603
#define ADRPT6                        1604
#define ADRPT7                        1605
#define ADCNT0                        1606
#define ADCNT                         1607
#define ADCNT1                        1608
#define ADCNT2                        1609
#define ADCNT3                        1610
#define ADCNT4                        1611
#define ADCNT5                        1612
#define ADCNT6                        1613
#define ADCNT7                        1614
#define ADSTPT0                       1615
#define ADSTPTL                       1616
#define ADSTPT1                       1617
#define ADSTPT2                       1618
#define ADSTPT3                       1619
#define ADSTPT4                       1620
#define ADSTPT5                       1621
#define ADSTPT6                       1622
#define ADSTPT7                       1623
#define ADSTPT8                       1624
#define ADSTPTH                       1625
#define ADSTPT9                       1626
#define ADSTPT10                      1627
#define ADSTPT11                      1628
#define ADSTPT12                      1629
#define ADSTPT13                      1630
#define ADSTPT14                      1631
#define ADSTPT15                      1632
#define ADLTH0                        1633
#define ADLTHL                        1634
#define ADLTH1                        1635
#define ADLTH2                        1636
#define ADLTH3                        1637
#define ADLTH4                        1638
#define ADLTH5                        1639
#define ADLTH6                        1640
#define ADLTH7                        1641
#define ADLTH8                        1642
#define ADLTHH                        1643
#define ADLTH9                        1644
#define ADLTH10                       1645
#define ADLTH11                       1646
#define ADLTH12                       1647
#define ADLTH13                       1648
