tiborsimon/embedded-tdd-headers/pic/8bit/pic18f26k40_tdd.h
#define ADLTH14                       1649
#define ADLTH15                       1650
#define ADUTH0                        1651
#define ADUTHL                        1652
#define ADUTH1                        1653
#define ADUTH2                        1654
#define ADUTH3                        1655
#define ADUTH4                        1656
#define ADUTH5                        1657
#define ADUTH6                        1658
#define ADUTH7                        1659
#define ADUTH8                        1660
#define ADUTHH                        1661
#define ADUTH9                        1662
#define ADUTH10                       1663
#define ADUTH11                       1664
#define ADUTH12                       1665
#define ADUTH13                       1666
#define ADUTH14                       1667
#define ADUTH15                       1668
#define ADERR0                        1669
#define ADERRL                        1670
#define ADERR1                        1671
#define ADERR2                        1672
#define ADERR3                        1673
#define ADERR4                        1674
#define ADERR5                        1675
#define ADERR6                        1676
#define ADERR7                        1677
#define ADERR8                        1678
#define ADERRH                        1679
#define ADERR9                        1680
#define ADERR10                       1681
#define ADERR11                       1682
#define ADERR12                       1683
#define ADERR13                       1684
#define ADERR14                       1685
#define ADERR15                       1686
#define ADACC0                        1687
#define ADACCL                        1688
#define ADACC1                        1689
#define ADACC2                        1690
#define ADACC3                        1691
#define ADACC4                        1692
#define ADACC5                        1693
#define ADACC6                        1694
#define ADACC7                        1695
#define ADACC8                        1696
#define ADACCH                        1697
#define ADACC9                        1698
#define ADACC10                       1699
#define ADACC11                       1700
#define ADACC12                       1701
#define ADACC13                       1702
#define ADACC14                       1703
#define ADACC15                       1704
#define ADFLTR0                       1705
#define ADFLTRL                       1706
#define ADFLTR1                       1707
#define ADFLTR2                       1708
#define ADFLTR3                       1709
#define ADFLTR4                       1710
#define ADFLTR5                       1711
#define ADFLTR6                       1712
#define ADFLTR7                       1713
#define ADFLTR8                       1714
#define ADFLTRH                       1715
#define ADFLTR9                       1716
#define ADFLTR10                      1717
#define ADFLTR11                      1718
#define ADFLTR12                      1719
#define ADFLTR13                      1720
#define ADFLTR14                      1721
#define ADFLTR15                      1722
#define CRCDATL                       1723
#define DATA0                         1724
#define DATA1                         1725
#define DATA2                         1726
#define DATA3                         1727
#define DATA4                         1728
#define DATA5                         1729
#define DATA6                         1730
#define DATA7                         1731
#define CRCDATH                       1732
#define DATA8                         1733
#define DATA9                         1734
#define DATA10                        1735
#define DATA11                        1736
#define DATA12                        1737
#define DATA13                        1738
#define DATA14                        1739
#define DATA15                        1740
#define CRCACCL                       1741
#define ACC0                          1742
#define ACC1                          1743
#define ACC2                          1744
#define ACC3                          1745
#define ACC4                          1746
#define ACC5                          1747
#define ACC6                          1748
#define ACC7                          1749
#define CRCACCH                       1750
#define ACC8                          1751
#define ACC9                          1752
#define ACC10                         1753
#define ACC11                         1754
#define ACC12                         1755
#define ACC13                         1756
#define ACC14                         1757
#define ACC15                         1758
#define CRCSHIFTL                     1759
#define SHFT0                         1760
#define SHFT1                         1761
#define SHFT2                         1762
#define SHFT3                         1763
#define SHFT4                         1764
#define SHFT5                         1765
#define SHFT6                         1766
#define SHFT7                         1767
#define CRCSHIFTH                     1768
#define SHFT8                         1769
#define SHFT9                         1770
#define SHFT10                        1771
#define SHFT11                        1772
#define SHFT12                        1773
#define SHFT13                        1774
#define SHFT14                        1775
#define SHFT15                        1776
#define CRCXORL                       1777
#define X1                            1778
#define X2                            1779
#define X3                            1780
#define X4                            1781
#define X5                            1782
#define X6                            1783
#define X7                            1784
#define CRCXORH                       1785
#define X8                            1786
#define X9                            1787
#define X10                           1788
#define X11                           1789
#define X12                           1790
#define X13                           1791
#define X14                           1792
#define X15                           1793
#define CRCCON0                       1794
#define FULL                          1795
#define SHIFTM                        1796
#define ACCM                          1797
#define CRCCON0_BUSY                  1798
#define CRCGO                         1799
#define CRCCON0_EN                    1800
#define CRCEN                         1801
#define CRCCON1                       1802
#define PLEN0                         1803
#define PLEN                          1804
#define PLEN1                         1805
#define PLEN2                         1806
#define PLEN3                         1807
#define DLEN                          1808
#define DLEN0                         1809
#define DLEN1                         1810
#define DLEN2                         1811
#define DLEN3                         1812
#define NVMADRL                       1813
#define ADR0                          1814
#define NVMADR0                       1815
#define ADRL                          1816
#define ADR1                          1817
#define NVMADR1                       1818
#define ADR2                          1819
#define NVMADR2                       1820
#define ADR3                          1821
#define NVMADR3                       1822
#define ADR4                          1823
#define NVMADR4                       1824
#define ADR5                          1825
#define NVMADR5                       1826
#define ADR6                          1827
#define NVMADR6                       1828
#define ADR7                          1829
#define NVMADR7                       1830
#define NVMADRH                       1831
#define ADRH                          1832
#define NVMADR8                       1833
#define ADR8                          1834
#define ADR9                          1835
#define NVMADR9                       1836
#define NVMDAT0                       1837
#define NVMDAT                        1838
#define NVMDAT1                       1839
#define NVMDAT2                       1840
#define NVMDAT3                       1841
#define NVMDAT4                       1842
#define NVMDAT5                       1843
#define NVMDAT6                       1844
#define NVMDAT7                       1845
#define NVMCON1                       1846
#define RD                            1847
#define WR                            1848
#define WREN                          1849
#define WRERR                         1850
#define FREE                          1851
#define NVMREG                        1852
#define NVMREG0                       1853
#define NVMREG1                       1854
#define NVMCON2                       1855
#define LATA                          1856
#define LATA0                         1857
#define LA0                           1858
#define LATA1                         1859
#define LA1                           1860
#define LATA2                         1861
#define LA2                           1862
#define LATA3                         1863
#define LA3                           1864
#define LATA4                         1865
#define LA4                           1866
#define LATA5                         1867
#define LA5                           1868
#define LATA6                         1869
#define LA6                           1870
#define LATA7                         1871
#define LA7                           1872
#define LATB                          1873
#define LB0                           1874
#define LATB0                         1875
#define LB1                           1876
#define LATB1                         1877
#define LB2                           1878
#define LATB2                         1879
#define LB3                           1880
#define LATB3                         1881
#define LB4                           1882
#define LATB4                         1883
#define LB5                           1884
#define LATB5                         1885
#define LB6                           1886
#define LATB6                         1887
#define LB7                           1888
#define LATB7                         1889
#define LATC                          1890
#define LATC0                         1891
#define LC0                           1892
#define LATC1                         1893
#define LC1                           1894
#define LATC2                         1895
#define LC2                           1896
#define LATC3                         1897
#define LC3                           1898
#define LATC4                         1899
#define LC4                           1900
#define LATC5                         1901
#define LC5                           1902
#define LATC6                         1903
#define LC6                           1904
#define LATC7                         1905
#define LC7                           1906
#define TRISA                         1907
#define TRISA0                        1908
#define TRISA1                        1909
#define TRISA2                        1910
#define TRISA3                        1911
#define TRISA4                        1912
#define TRISA5                        1913
#define TRISA6                        1914
#define TRISA7                        1915
#define TRISB                         1916
#define TRISB0                        1917
#define TRISB1                        1918
#define TRISB2                        1919
#define TRISB3                        1920
#define TRISB4                        1921
#define TRISB5                        1922
#define TRISB6                        1923
#define TRISB7                        1924
#define TRISC                         1925
#define TRISC0                        1926
#define TRISC1                        1927
#define TRISC2                        1928
#define TRISC3                        1929
#define TRISC4                        1930
#define TRISC5                        1931
#define TRISC6                        1932
#define TRISC7                        1933
#define PORTA                         1934
#define ULPWUIN                       1935
#define RA0                           1936
#define RA1                           1937
#define RA2                           1938
#define RA3                           1939
#define RA4                           1940
#define LVDIN                         1941
#define RA5                           1942
#define RA6                           1943
#define RA7                           1944
#define RJPU                          1945
#define PORTB                         1946
#define RB0                           1947
#define RB1                           1948
#define RB2                           1949
#define CCP2_PA2                      1950
#define RB3                           1951
#define RB4                           1952
#define RB5                           1953
#define RB6                           1954
#define RB7                           1955
#define PORTC                         1956
#define RC0                           1957
#define PA2                           1958
#define RC1                           1959
#define CCP2                          1960
#define PA1                           1961
#define RC2                           1962
#define RC3                           1963
#define RC4                           1964
#define RC5                           1965
#define RC6                           1966
#define RC7                           1967
#define PORTE                         1968
#define PD2                           1969
#define RDE                           1970
#define RE0                           1971
#define WRE                           1972
#define RE1                           1973
#define PC2                           1974
#define PORTE_CS                      1975
#define CCP10                         1976
#define PB2                           1977
#define RE2                           1978
#define CCP9E                         1979
#define RE3                           1980
#define PC3E                          1981
#define RE4                           1982
#define PB3E                          1983
#define CCP8E                         1984
#define CCP7E                         1985
#define RE5                           1986
#define PC1E                          1987
#define CCP6E                         1988
#define RE6                           1989
#define PB1E                          1990
#define CCP2E                         1991
#define PA2E                          1992
#define RE7                           1993
#define SSP1BUF                       1994
#define SSP1BUF_SSPBUF                1995
#define SSP1ADD                       1996
#define SSP1ADD_SSPADD                1997
#define SSP1ADD_MSK0                  1998
#define MSK01                         1999
#define SSP1ADD_MSK1                  2000
#define MSK11                         2001
#define SSP1ADD_MSK2                  2002
#define MSK21                         2003
#define MSK31                         2004
#define SSP1ADD_MSK3                  2005
#define SSP1ADD_MSK4                  2006
#define MSK41                         2007
#define MSK51                         2008
#define SSP1ADD_MSK5                  2009
#define SSP1ADD_MSK6                  2010
#define MSK61                         2011
#define MSK71                         2012
#define SSP1ADD_MSK7                  2013
#define SSP1MSK                       2014
#define SSP1MSK_MSK0                  2015
#define SSP1MSK_SSPMSK                2016
#define SSP1MSK_MSK1                  2017
#define SSP1MSK_MSK2                  2018
#define SSP1MSK_MSK3                  2019
#define SSP1MSK_MSK4                  2020
#define SSP1MSK_MSK5                  2021
#define SSP1MSK_MSK6                  2022
#define SSP1MSK_MSK7                  2023
#define SSP1STAT                      2024
#define BF1                           2025
#define SSP1STAT_BF                   2026
#define UA1                           2027
#define SSP1STAT_UA                   2028
#define SSP1STAT_R_NOT_W              2029
#define RW1                           2030
#define SSP1STAT_nW                   2031
#define RW                            2032
#define SSP1STAT_READ_WRITE           2033
#define SSP1STAT_nWRITE               2034
#define SSP1STAT_I2C_READ             2035
#define SSP1STAT_R_W                  2036
#define R                             2037
#define SSP1STAT_NOT_WRITE            2038
#define SSP1STAT_R_nW                 2039
#define SSP1STAT_S                    2040
#define START                         2041
#define START1                        2042
#define SSP1STAT_I2C_START            2043
#define STOP                          2044
#define SSP1STAT_P                    2045
#define STOP1                         2046
#define SSP1STAT_I2C_STOP             2047
#define SSP1STAT_D_NOT_A              2048
#define SSP1STAT_D_A                  2049
#define SSP1STAT_D_nA                 2050
#define SSP1STAT_NOT_ADDRESS          2051
#define SSP1STAT_DATA_ADDRESS         2052
#define SSP1STAT_nA                   2053
#define D                             2054
#define DA1                           2055
#define DA                            2056
#define SSP1STAT_nADDRESS             2057
#define SSP1STAT_I2C_DAT              2058
#define SSP1STAT_CKE                  2059
#define CKE1                          2060
#define SSP1STAT_SMP                  2061
#define SMP1                          2062
#define SSP1CON1                      2063
#define SSP1CON1_SSPM0                2064
#define SSPM01                        2065
#define SSP1CON1_SSPM                 2066
#define SSP1CON1_SSPM1                2067
#define SSPM11                        2068
#define SSP1CON1_SSPM2                2069
#define SSPM21                        2070
#define SSPM31                        2071
#define SSP1CON1_SSPM3                2072
#define SSP1CON1_CKP                  2073
#define CKP1                          2074
#define SSPEN1                        2075
#define SSP1CON1_SSPEN                2076
#define SSPOV1                        2077
#define SSP1CON1_SSPOV                2078
#define WCOL1                         2079
#define SSP1CON1_WCOL                 2080
#define SSP1CON2                      2081
#define SEN1                          2082
#define SSP1CON2_SEN                  2083
#define ADMSK11                       2084
#define SSP1CON2_RSEN                 2085
#define RSEN1                         2086
#define SSP1CON2_ADMSK1               2087
#define SSP1CON2_ADMSK                2088
#define SSP1CON2_PEN                  2089
#define ADMSK21                       2090
#define PEN1                          2091
#define SSP1CON2_ADMSK2               2092
#define ADMSK31                       2093
#define RCEN1                         2094
#define SSP1CON2_RCEN                 2095
#define SSP1CON2_ADMSK3               2096
#define SSP1CON2_ACKEN                2097
#define ACKEN1                        2098
#define ADMSK41                       2099
#define SSP1CON2_ADMSK4               2100
#define ACKDT1                        2101
#define ADMSK51                       2102
#define SSP1CON2_ACKDT                2103
#define SSP1CON2_ADMSK5               2104
#define SSP1CON2_ACKSTAT              2105
#define ACKSTAT1                      2106
#define GCEN1                         2107
#define SSP1CON2_GCEN                 2108
#define SSP1CON3                      2109
#define SSP1CON3_DHEN                 2110
#define SSP1CON3_AHEN                 2111
#define SSP1CON3_SBCDE                2112
#define SSP1CON3_SDAHT                2113
#define SSP1CON3_BOEN                 2114
#define SSP1CON3_SCIE                 2115
#define SSP1CON3_PCIE                 2116
#define SSP1CON3_ACKTIM               2117
#define RC1REG                        2118
#define TX1REG                        2119
#define SP1BRGL                       2120
#define SP1BRGH                       2121
#define RC1STA                        2122
#define RC1STA_RX9D                   2123
#define RCD8                          2124
#define RC1STA_OERR                   2125
#define RC1STA_FERR                   2126
#define RC1STA_ADDEN                  2127
#define RC1STA_CREN                   2128
#define RC1STA_SREN                   2129
#define RC1STA_RX9                    2130
#define RC8_9                         2131
#define RC9                           2132
#define RC1STA_SPEN                   2133
#define TX1STA                        2134
#define TXD8                          2135
#define TX1STA_TX9D                   2136
#define TX1STA_TRMT                   2137
#define TX1STA_BRGH                   2138
#define TX1STA_SENDB                  2139
#define TX1STA_SYNC                   2140
#define TX1STA_TXEN                   2141
#define TX1STA_TX9                    2142
#define TX8_9                         2143
#define TX1STA_CSRC                   2144
#define BAUD1CON                      2145
#define ABDEN1                        2146
#define BAUD1CON_ABDEN                2147
#define WUE1                          2148
#define BAUD1CON_WUE                  2149
#define BRG161                        2150
#define BAUD1CON_BRG16                2151
#define SCKP1                         2152
#define CKTXP                         2153
#define TXCKP                         2154
#define BAUD1CON_SCKP                 2155
#define TXCKP1                        2156
#define BAUD1CON_RCIDL                2157
#define RCMT1                         2158
#define RCIDL1                        2159
#define RCMT                          2160
#define BAUD1CON_ABDOVF               2161
#define ABDOVF1                       2162
#define PWM4DCL                       2163
#define PWM4DCL_PWMPW0                2164
#define PWM4DCL_DC                    2165
#define PWM4DC0                       2166
#define PWM4DCL_DC0                   2167
#define PWM4DCL_PWMPW1                2168
#define PWM4DC1                       2169
#define PWM4DCL_DC1                   2170
#define PWM4DCH                       2171
#define PWM4DCH_PWMPW2                2172
#define PWM4DCH_DC                    2173
#define PWM4DC2                       2174
#define PWM4DCH_DC2                   2175
#define PWM4DCH_PWMPW3                2176
#define PWM4DC3                       2177
#define PWM4DCH_DC3                   2178
#define PWM4DCH_PWMPW4                2179
#define PWM4DC4                       2180
#define PWM4DCH_DC4                   2181
#define PWM4DCH_PWMPW5                2182
#define PWM4DC5                       2183
#define PWM4DCH_DC5                   2184
#define PWM4DCH_PWMPW6                2185
#define PWM4DC6                       2186
#define PWM4DCH_DC6                   2187
#define PWM4DCH_PWMPW7                2188
#define PWM4DC7                       2189
#define PWM4DCH_DC7                   2190
#define PWM4DCH_PWMPW8                2191
#define PWM4DC8                       2192
#define PWM4DCH_DC8                   2193
#define PWM4DCH_PWMPW9                2194
#define PWM4DC9                       2195
#define PWM4DCH_DC9                   2196
#define PWM4CON                       2197
#define PWM4POL                       2198
#define PWM4CON_POL                   2199
#define PWM4CON_OUT                   2200
#define PWM4OUT                       2201
#define PWM4EN                        2202
#define PWM4CON_EN                    2203
#define PWM3DCL                       2204
#define PWM3DC0                       2205
#define PWM3DCL_PWMPW0                2206
